---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.HasValue
source: html/9dc67fdf-b949-0404-7522-57bf50e11e62.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.HasValue Method

Check if color entry has associated value.

## Syntax (C#)
```csharp
public bool HasValue()
```

## Returns
True if entry has a value associated with it, false otherwise.